# Importante

- Añadir a cada grafico un texto tipo Observaciones explicando como se tiene que interpretar la información.

- Hay que terminar con conclusiones
## Introducción

# Índice

1. [Introducción](#1-introducción)  
    A. [Datos meteorológicos](#a-datos-meteorológicos)  
    B. [Datos geográficos](#b-datos-geográficos)  
    C. [Coordenadas en shp de España](#c-coordenadas-en-shp-de-españa)  

2. [Manipulación de los datos](#2-manipulación-de-los-datos)  
    A. [Coordenadas del mapa](#a-tabla-con-coordenadas-geométricas-del-mapa)  
    B. [Estaciones y datos históricos](#b-tabla-con-coordenadas-de-las-estaciones)  
    C. [Unión de datos](#c-unión-de-la-información-de-datos-geométricos)  
    D. [Resumen de clima](#d-adaptación-y-resumen-de-la-tabla-de-clima)  

3. [Gráficas](#3-representaciones-gráficas-de-los-datos)  
    A. [Puntos y mapa](#a-presentación-de-los-puntos-y-el-mapa)  
        a. [Por provincia](#a-puntos-por-provincia)  
        b. [Por orientación](#b-puntos-por-orientacion-oeste--este)

## Cosas instalación previa

- python -m ipykernel install --user --name=venv_dataset_project --display-name

## Hipotesis que se desean demostrar con los datos

- Normalización de salarios con respecto al coste de vida de los países.
- ¿Cuál es el país con

# Fuentes de dataset

- Puestos de trabajos relacionados con IA: https://www.kaggle.com/datasets/bismasajjad/global-ai-job-market-and-salary-trends-2025/data
- Puestos de trabajos a nivel tecnológico: https://www.kaggle.com/datasets/yaaryiitturan/global-tech-salary-dataset

- Análisis de coste de vida: https://www.kaggle.com/datasets/myrios/cost-of-living-index-by-country-by-number-2024
- Salario promedio por países: https://www.kaggle.com/datasets/meeratif/list-of-countries-by-average-wage-monthly-yearly
- Indice de desarrollo humano: https://hdr.undp.org/data-center/documentation-and-downloads

## Cargado de datos y primera toma de contacto

In [108]:
import pandas as pd
import os

path_ai_jobs = os.path.join('data','ai_job_dataset.csv')
path_global_tech = os.path.join('data', 'global_tech_salary.txt')
path_cost_of_living = os.path.join('data', 'Cost_of_Living_Index_by_Country_2024.csv')
path_avg_salary = os.path.join('data', 'salary_data.csv')
path_idh = os.path.join('data', 'HDR25_Statistical.xlsx')

ai_job_df = pd.read_csv(path_ai_jobs, sep=',')
global_tech_df = pd.read_csv(path_global_tech, sep=',')
cost_of_life_df = pd.read_csv(path_cost_of_living, sep=',')
avg_salary_df = pd.read_csv(path_avg_salary, sep=',')
idh_df = pd.read_excel(path_idh, sheet_name='Table 1. HDI')

print('OFERTAR LABORALES EN IA')
# Pasamos de snake_case a Title Case y quitamos guiones bajos
ai_job_df.columns = ai_job_df.columns.str.replace('_', ' ').str.title().str.strip()

# Renombramos la columna 'Employee Residence' a 'Country' para unificar con los otros DataFrames
ai_job_df = ai_job_df.rename(columns={'Employee Residence': 'Country'})
ai_job_df = ai_job_df.rename(columns={'Salary Usd': 'Salary USD'})
display(ai_job_df.sample(5))

print('OFERTAS LABORALES A NIVEL TECNOLÓGICO GLOBAL')
global_tech_df.columns = global_tech_df.columns.str.replace('_', ' ').str.title().str.strip()

# Renombramos la columna 'Country or Area' a 'Country' para unificar con los otros DataFrames
global_tech_df = global_tech_df.rename(columns={'Employee Residence': 'Country'})
global_tech_df = global_tech_df.rename(columns={'Salary In Usd': 'Salary USD'})
display(global_tech_df.sample(5))

print('COSTE DE VIDA POR PAÍSES')
display(cost_of_life_df.sample(5))

print('SALARIO PROMEDIO POR PAÍSES')
# Pasamos de snake_case a Title Case y quitamos guiones bajos

avg_salary_df.columns = avg_salary_df.columns.str.replace('_', ' ').str.title().str.strip()
avg_salary_df = avg_salary_df.rename(columns={'Country Name': 'Country'})
display(avg_salary_df.sample(5))

print('ÍNDICE DE DESARROLLO HUMANO (IDH)')
idh_df = idh_df.rename(columns={'Country or Area': 'Country'})
display(idh_df.sample(5))

OFERTAR LABORALES EN IA

,Job Id,Job Title,Salary USD,Salary Currency,Experience Level,Employment Type,Company Location,Company Size,Country,Remote Ratio,Required Skills,Education Required,Years Experience,Industry,Posting Date,Application Deadline,Job Description Length,Benefits Score,Company Name
9032,AI09033,Head of AI,90609,USD,SE,CT,China,S,China,50,"Spark, SQL, MLOps, Python",Bachelor,5,Government,2024-07-14,2024-08-16,1640,9.7,Autonomous Tech
12344,AI12345,Principal Data Scientist,83942,USD,EN,FL,United States,L,United States,50,"Azure, Git, AWS, TensorFlow, Computer Vision",PhD,0,Finance,2024-06-22,2024-08-29,785,5.2,TechCorp Inc
5608,AI05609,Data Engineer,189578,USD,EX,CT,Switzerland,S,Finland,50,"PyTorch, Java, Git, Azure",Master,11,Healthcare,2024-12-07,2025-01-29,993,7.5,Autonomous Tech
4650,AI04651,Autonomous Systems Engineer,79626,USD,SE,FL,Ireland,S,India,0,"Python, TensorFlow, Kubernetes, Docker, Spark",Master,8,Healthcare,2024-11-03,2024-11-17,2459,6.9,DataVision Ltd
2195,AI02196,Data Scientist,66889,USD,MI,FL,Austria,M,Japan,0,"Hadoop, Computer Vision, Data Visualization, S...",PhD,3,Transportation,2025-04-06,2025-04-24,537,7.6,Machine Intelligence Group

OFERTAS LABORALES A NIVEL TECNOLÓGICO GLOBAL

,Work Year,Experience Level,Employment Type,Job Title,Salary,Salary Currency,Salary USD,Country,Remote Ratio,Company Location,Company Size
3390,2023,MI,FT,Data Analyst,64500,USD,64500,US,0,US,M
1211,2024,SE,FT,Data Scientist,155000,USD,155000,US,100,US,M
1705,2023,EN,FT,Data Engineer,85000,USD,85000,US,0,US,M
4501,2021,MI,FT,Cloud Data Engineer,120000,SGD,89294,SG,50,SG,L
1894,2023,SE,FT,Research Analyst,107000,USD,107000,US,0,US,M

COSTE DE VIDA POR PAÍSES

,Rank,Country,Cost of Living Index,Rent Index,Cost of Living Plus Rent Index,Groceries Index,Restaurant Price Index,Local Purchasing Power Index
55,56,Palestine,41.6,8.0,25.5,40.7,27.4,46.1
119,120,Libya,20.4,4.3,12.7,22.2,15.2,42.0
51,52,Kuwait,42.1,22.6,32.7,34.5,36.4,161.8
113,114,Madagascar,24.5,7.8,16.5,24.1,14.3,15.6
74,75,Fiji,35.4,15.3,25.8,43.7,28.4,68.0

SALARIO PROMEDIO POR PAÍSES

,Country,Continent Name,Wage Span,Median Salary,Average Salary,Lowest Salary,Highest Salary
141,Nepal,Asia,Monthly,551.13,608.20,153.18,2703.11
204,Turks and Caicos Islands,North America,Monthly,1350.00,1490.00,380.00,6640.00
212,Vanuatu,Oceania,Monthly,750.74,821.77,207.30,3650.48
100,Jersey,Europe,Monthly,5817.07,6304.88,1585.37,28048.78
125,Marshall Islands,Oceania,Monthly,2070.00,2260.00,570.00,10100.00

ÍNDICE DE DESARROLLO HUMANO (IDH)

,HDI rank,Country,Human Development Index (HDI),Life expectancy at birth,Expected years of schooling,Mean years of schooling,Gross national income (GNI) per capita,GNI per capita rank minus HDI rank,HDI rank.1
128,129,Tuvalu,0.689,67.105,12.375069,10.767461,7005.520781,4,130
62,62,Serbia,0.833,76.769,15.042160,11.641718,23114.809530,7,61
10,11,Ireland,0.949,82.412,19.184879,11.725000,90884.634590,-6,10
102,103,Saint Lucia,0.748,72.697,12.730410,8.614167,20899.781930,-29,102
15,16,Canada,0.939,82.630,15.888260,13.870000,54688.417290,9,16

## Datos representativos de los datasets objeto de estudio

In [109]:
summary_df = pd.DataFrame({
    'Dataset asociado': ['Puestos de trabajo IA', 'Global Tech Salary', 'Coste de vida', 'Salario promedio por países', 'Indice de Desarrollo Humano (IDH)'],
    'Número de entradas': [len(ai_job_df), len(global_tech_df), len(cost_of_life_df), len(avg_salary_df), len(idh_df)],
    'Número de columnas': [ai_job_df.shape[1], global_tech_df.shape[1], cost_of_life_df.shape[1], avg_salary_df.shape[1], idh_df.shape[1]],
    'Columnas Categóricas': [
        ai_job_df.select_dtypes(include='object').shape[1],
        global_tech_df.select_dtypes(include='object').shape[1],
        cost_of_life_df.select_dtypes(include='object').shape[1],
        avg_salary_df.select_dtypes(include='object').shape[1],
        idh_df.select_dtypes(include='object').shape[1],
    ],
    'Columnas Numéricas': [
        ai_job_df.select_dtypes(include='number').shape[1],
        global_tech_df.select_dtypes(include='number').shape[1],
        cost_of_life_df.select_dtypes(include='number').shape[1],
        avg_salary_df.select_dtypes(include='number').shape[1],
        idh_df.select_dtypes(include='number').shape[1],
    ],
        'Nulos totales': [
        ai_job_df.isnull().sum().sum(),
        global_tech_df.isnull().sum().sum(),
        cost_of_life_df.isnull().sum().sum(),
        avg_salary_df.isnull().sum().sum(),
        idh_df.isnull().sum().sum()
    ],
    'Filas duplicadas': [
        ai_job_df.duplicated().sum(),
        global_tech_df.duplicated().sum(),
        cost_of_life_df.duplicated().sum(),
        avg_salary_df.duplicated().sum(),
        idh_df.duplicated().sum()
    ],
    'Número países implicados': [
        ai_job_df['Country'].nunique(),
        global_tech_df['Country'].nunique(),
        cost_of_life_df['Country'].nunique(),
        avg_salary_df['Country'].nunique(),
        idh_df['Country'].nunique()
    ]
    })

display(summary_df)

,Dataset asociado,Número de entradas,Número de columnas,Columnas Categóricas,Columnas Numéricas,Nulos totales,Filas duplicadas,Número países implicados
0,Puestos de trabajo IA,15000,19,14,5,0,0,20
1,Global Tech Salary,5000,11,7,4,0,1144,55
2,Coste de vida,121,8,1,7,0,0,121
3,Salario promedio por países,221,7,3,4,0,0,221
4,Indice de Desarrollo Humano (IDH),193,9,2,7,0,0,193

<b>Primeras conclusiones</b>
- El dataset puestos de trabajos en IA es rico en datos teniendo 15.000 entradas y 19 columnas, lo cual, nos proporcionará una buena base para tener una visión general del mercado laboral en IA.
- Los datasets de costes de vida, salario promedio por países e índice de desarrollo humano tienen un número de entradas coherentes con el número de países que existen en el mundo, aunque hay uqe subrayar que el dataset "Coste de vida" tiene un número de entradas inferior, por lo que no se podrá hacer una comparación directa con todos los países, sino que habrá que hacer una selección de los páises que están en común entre los cuatro datasets.
- No hay valores nulos ni filas duplicadas en los datasets, lo cual es positivo para el análisis posterior.

A continuación, nos centraremos en averiguar qué países quedarán expluidos de la comparación por no tener datos en todos los datasets.

## Limpieza de datos y normalización de datos

<b>Cambios básicos</b><br>

Empezamos con una eliminación de duplicados en el dataset de puestos de trabajos en IA, ya que hay entradas duplicadas. Esto es importante para evitar sesgos en el análisis posterior. Además, ponemos los nombres de los países en minúsculas para facilitar la comparación con los otros datasets.

In [110]:
# Eliminamos duplicados y reseteamos el índice en global_tech_df
global_tech_df = global_tech_df.drop_duplicates().reset_index(drop=True)

# Ponemos nombres de países en minúsculas y sin espacios extra
ai_job_df['Country'] = ai_job_df["Country"].str.strip().str.lower()
cost_of_life_df['Country'] = cost_of_life_df["Country"].str.strip().str.lower()
avg_salary_df['Country'] = avg_salary_df["Country"].str.strip().str.lower()
idh_df['Country'] = idh_df["Country"].str.strip().str.lower()
global_tech_df['Country'] = global_tech_df["Country"].str.strip().str.lower()

<b>Nombres de países en el dataset "Global Tech Salary"</b>

Tenemos un caso especial donde los nombres de páises en el dataset "Global Tech Salary" no coinciden con los nombres de países en los otros datasets. Por ejemplo, "USA" en lugar de "united states". Para solucionar esto, crearemos un diccionario de mapeo para normalizar los nombres de países utilizando la librería de terceros "pycountry" para obtener los nombres oficiales de los países y según su código ISO.

In [111]:
import pycountry # Módulo para obtener nombres de países segun codigo
global_tech_df["Country"].unique()

def codigo_a_nombre(codigo):
    try:
        return pycountry.countries.get(alpha_2=codigo).name.strip().lower()
    except:
        return codigo
    
global_tech_df["Country"] = global_tech_df["Country"].map(codigo_a_nombre)

display(global_tech_df.sample(5))

,Work Year,Experience Level,Employment Type,Job Title,Salary,Salary Currency,Salary USD,Country,Remote Ratio,Company Location,Company Size
1876,2023,SE,FT,Data Engineer,85000,USD,85000,united states,100,US,M
198,2023,SE,FT,Data Scientist,228045,USD,228045,united states,100,US,M
1254,2024,SE,FT,Data Engineer,150000,USD,150000,united states,100,US,M
289,2023,SE,FT,Data Engineer,130000,USD,130000,united states,100,US,M
2646,2022,SE,FT,Data Engineer,84958,GBP,104611,united kingdom,100,GB,M

<b>Nivel de experiencia y tipo de trabajo</b>

Continuamos expandiendo los acrónimos de los niveles de experiencia y tipos de trabajo en el dataset "Global Tech Salary". Por ejemplo, "Jr" se convierte en "Junior", "Sr" en "Senior", y así sucesivamente. Esto nos permitirá tener una mejor comprensión de los datos y facilitará el análisis posterior.

In [112]:
EXPERIENCE_LEVEL_MAP = {
    "EN": "Entry-level",
    "MI": "Mid-level",
    "SE": "Senior-level",
    "EX": "Executive-level",
}

EMPLOYMENT_TYPE_MAP = {
    "FT": "Full-time",
    "PT": "Part-time",
    "CT": "Contract",
    "FL": "Freelance",
    "IN": "Internship",
}

COMPANY_SIZE_MAP = {
    "S": "Small",
    "M": "Medium",
    "L": "Large",
}

global_tech_df['Experience Level'] = global_tech_df['Experience Level'].map(lambda  exp: EXPERIENCE_LEVEL_MAP[exp] if exp in EXPERIENCE_LEVEL_MAP else exp)
global_tech_df['Employment Type'] = global_tech_df["Employment Type"].map(lambda emp: EMPLOYMENT_TYPE_MAP[emp] if emp in EMPLOYMENT_TYPE_MAP else emp)
global_tech_df['Company Size'] = global_tech_df["Company Size"].map(lambda size: COMPANY_SIZE_MAP[size] if size in COMPANY_SIZE_MAP else size)

ai_job_df["Experience Level"] = ai_job_df["Experience Level"].map(lambda exp: EXPERIENCE_LEVEL_MAP[exp] if exp in EXPERIENCE_LEVEL_MAP else exp)
ai_job_df["Employment Type"] = ai_job_df["Employment Type"].map(lambda emp: EMPLOYMENT_TYPE_MAP[emp] if emp in EMPLOYMENT_TYPE_MAP else emp)
ai_job_df["Company Size"] = ai_job_df["Company Size"].map(lambda size: COMPANY_SIZE_MAP[size] if size in COMPANY_SIZE_MAP else size)

display(global_tech_df.sample(5))
display(ai_job_df.sample(5))

,Work Year,Experience Level,Employment Type,Job Title,Salary,Salary Currency,Salary USD,Country,Remote Ratio,Company Location,Company Size
3480,2024,Mid-level,Full-time,Data Scientist,150000,USD,150000,united states,0,US,Medium
266,2024,Mid-level,Full-time,Machine Learning Engineer,99100,USD,99100,united states,0,US,Medium
470,2023,Senior-level,Full-time,Data Engineer,166000,USD,166000,united states,0,US,Medium
810,2023,Senior-level,Full-time,Data Science Consultant,131100,USD,131100,united states,0,US,Medium
978,2024,Executive-level,Full-time,Data Engineer,168854,USD,168854,united states,0,US,Medium

,Job Id,Job Title,Salary USD,Salary Currency,Experience Level,Employment Type,Company Location,Company Size,Country,Remote Ratio,Required Skills,Education Required,Years Experience,Industry,Posting Date,Application Deadline,Job Description Length,Benefits Score,Company Name
6200,AI06201,Machine Learning Researcher,70552,EUR,Mid-level,Contract,France,Small,austria,0,"SQL, Computer Vision, Docker, Python",Master,3,Consulting,2024-01-02,2024-02-20,1654,8.4,Algorithmic Solutions
3606,AI03607,ML Ops Engineer,72276,USD,Senior-level,Part-time,Finland,Medium,australia,0,"Python, TensorFlow, PyTorch",Associate,8,Healthcare,2024-12-05,2025-01-04,1081,7.6,Autonomous Tech
12040,AI12041,ML Ops Engineer,87031,USD,Senior-level,Freelance,South Korea,Medium,india,100,"SQL, Hadoop, Deep Learning, Computer Vision",Bachelor,7,Energy,2024-12-22,2025-01-28,1302,9.7,Machine Intelligence Group
4224,AI04225,AI Product Manager,99330,USD,Senior-level,Freelance,South Korea,Medium,south korea,0,"Python, SQL, Tableau, Hadoop",Associate,9,Transportation,2024-07-11,2024-08-31,2083,7.4,TechCorp Inc
4085,AI04086,ML Ops Engineer,302743,USD,Executive-level,Freelance,Norway,Large,norway,100,"Tableau, Kubernetes, Deep Learning, Computer V...",Bachelor,10,Education,2024-07-13,2024-09-02,698,9.3,Machine Intelligence Group

<b>Selección de información relevante para el estudio</b>

Dado que queremos hacer una unión vertical de los datasets, es necesario seleccionar las columnas que son comunes entre ellos. En este caso, las columnas relevantes son:
- "Job title" (título del trabajo).
- "Country" (país).
- "Salary In Usd" (salario): En el primer dataset cogeremos el salario normalizado a USD.
- "Nivel de experiencia" (nivel de experiencia).
- "Tipo de trabajo" (tipo de trabajo).

In [121]:
common_columns = list(set(global_tech_df.columns) & set(ai_job_df.columns))

global_tech_reduced = global_tech_df[common_columns]
ai_job_reduced = ai_job_df[common_columns]

all_tech_jobs_df = pd.concat([global_tech_reduced, ai_job_reduced], ignore_index=True)
display(all_tech_jobs_df.sample(10))

,Salary Currency,Experience Level,Employment Type,Job Title,Salary USD,Company Size,Country,Company Location,Remote Ratio
965,USD,Senior-level,Full-time,Machine Learning Engineer,164000,Medium,united states,US,100
6304,EUR,Executive-level,Part-time,Autonomous Systems Engineer,145351,Small,germany,Germany,0
2253,USD,Mid-level,Full-time,Data Scientist,90500,Medium,united states,US,100
934,USD,Mid-level,Full-time,Robotics Software Engineer,198000,Medium,united states,US,0
16557,USD,Executive-level,Contract,Autonomous Systems Engineer,161792,Large,canada,Canada,0
13881,USD,Mid-level,Part-time,Data Engineer,90945,Large,singapore,Singapore,100
12689,EUR,Senior-level,Full-time,Computer Vision Engineer,112638,Large,france,France,50
18032,EUR,Mid-level,Full-time,AI Product Manager,90070,Large,netherlands,Netherlands,100
13633,USD,Entry-level,Freelance,AI Product Manager,42123,Medium,israel,Israel,0
7547,EUR,Senior-level,Full-time,Data Engineer,120407,Medium,finland,Netherlands,0

## Respondiendo a preguntas
### ¿Qué países salen en las ofertas de trabajo en IA?

In [114]:
print("Número de páises objeto de estudio: ", len(ai_job_df["Country"].unique()))  # Número de países únicos en el DataFrame de trabajos IA
print("Países objeto de estudio: ", ai_job_df["Country"].unique())  # Lista de países únicos en el DataFrame de trabajos IA

Número de páises objeto de estudio:  20
Países objeto de estudio:  ['china' 'ireland' 'south korea' 'india' 'singapore' 'germany'
 'united kingdom' 'france' 'austria' 'sweden' 'norway' 'israel'
 'united states' 'netherlands' 'denmark' 'switzerland' 'finland' 'japan'
 'canada' 'australia']